tutorials/combustion/fireFoam/LES/oppositeBurningPanels/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.15 0 -0.6)
    ( 0.15 0 -0.6)
    ( 0.15 4.2 -0.6)
    (-0.15 4.2 -0.6)
    (-0.15 0 0.6)
    ( 0.15 0 0.6)
    ( 0.15 4.2 0.6)
    (-0.15 4.2 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (16 124 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    ground
    {
        type    wall;
        faces
        (
            (0 1 5 4)
        );
    }

    sides
    {
        type    patch;
        faces
        (
            (1 2 6 5)
            (0 3 2 1)
            (0 4 7 3)
            (6 7 4 5)
        );
    }

    top
    {
        type    patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
